In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("./advent_of_code_day1", header=None)

In [3]:
data.head()

        0
0  142156
1  108763
2   77236
3   78186
4  110145

In [4]:
import numpy as np
fuelcountupper = data.apply(lambda x: np.floor(x/3) - 2)
fuelcountupper

          0
0   47383.0
1   36252.0
2   25743.0
3   26060.0
4   36713.0
..      ...
95  46314.0
96  29435.0
97  33823.0
98  43241.0
99  31270.0

[100 rows x 1 columns]

In [5]:
assert np.sum(fuelcountupper)[0] == 3318632